print("Введите непонятное слово: ")
word = input().upper()
meme_dict = {
                "КРИНЖ": "- Что-то очень странное или стыдное",
                "ЛОЛ": "- Что-то очень смешное",
                "РОФЛ": "- Шутка",
                "ЩИЩ": "- Одобрение или восторг",
                "КРИПОВЫЙ": "-  Страшный, пугающий",
                "АГРИТЬСЯ": "Злиться",
                "НИШЕВЫЙ": "Что-то необычное, уникальное"
                }
    if word in meme_dict.keys():
        print(meme_dict[word])
        print(" ")
    else:
        print("Просим прощения, в нашем словаре такого слова не нашлось :(")
        print(" ")
        
while word.upper() != "СПАСИБО":
    word = input("Введите непонятное слово: ").upper()
    if word in meme_dict.keys():
        print(meme_dict[word])
        print("   ")
    else:
        print("Просим прощения, в нашем словаре такого слова не нашлось :(")
        print("   ")
